# Brewfile - dev tools for the Warp-centric Claude Code stack.
# Install with: brew bundle --file=Brewfile --no-lock

# --- CLI tools ---
brew "git"
brew "gh"
brew "node"
brew "jq"
brew "fzf"               # PR-picker fallback in the worktree scripts
brew "ripgrep"
brew "graphite"          # gt (optional; plain-git-first workflow)
brew "lazygit"
brew "just"
brew "tmux"

# --- languages / runtimes ---
brew "go"
brew "rust"
brew "python@3.13"
brew "astral-sh/tap/uv"  # uv (Python package manager)

# --- dev apps ---
cask "warp"              # primary terminal
cask "zed"               # primary editor
cask "visual-studio-code"
cask "claude"            # Claude desktop app
cask "docker-desktop"
